Section 4: Handling Errors with try and except/Section 4.tex
% Created 2021-07-31 Sat 13:19
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mohammed Asir Shahid}
\date{2021-07-31}
\title{Section 4\\\medskip
\large Handling Errors with try/except}
\hypersetup{
 pdfauthor={Mohammed Asir Shahid},
 pdftitle={Section 4},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Try and Except statements}
\label{sec:org4e23b3a}

Right now, getting an error or exception leads to the program crashing. However, we generally don't want this to happen in real life. We want the program to detect errors, handle them, and then continue running.



\begin{verbatim}

def div42by(divideBy):
    return 42/ divideBy

print(div42by(2))
print(div42by(12))
print(div42by(0))
print(div42by(1))

\end{verbatim}

Running this causes an error. as we are trying to divide by 0, which is not mathematically allowed. So whenever this happens, the program crashes and terminates. We do not want one mistake to crash the entire program. We can try doing the following:


\begin{verbatim}

def div42by(divideBy):
    try:
        return 42/ divideBy
    except ZeroDivisionError:
        print("Erorr: You tried to divide by zero.")


print(div42by(2))
print(div42by(12))
print(div42by(0))
print(div42by(1))

\end{verbatim}

\begin{verbatim}
21.0
3.5
Erorr: You tried to divide by zero.
None
42.0
\end{verbatim}


Now with this try/except, the program will still continue running despite the error we ran into.

This is because when the code in the try clause causes a zero division error, it runs the code in the except clause. Following that, the code execution continues running like normal.

We can also just have a standard, general except clause which will catch all kinds of errors. This can be useful when we allow users to input a value.

\begin{verbatim}

print("How many cats do you have?")
print(numCats)

# numCats=input()

if int(numCats)>=4:
    print("That is a lot of cats.")
else:
    print("That is not many cats.")

\end{verbatim}

\begin{verbatim}
How many cats do you have?
1
That is not many cats.
\end{verbatim}


With an open ended input like we have above, the user can type in whatever value they want. This can causes errors since we can't turn any random string into an int. In order to fix this, we can use the try/except clauses.


\begin{verbatim}

print("How many cats do you have?")
print(numCats)

# numCats=input()

try:
    if int(numCats)>=4:
        print("That is a lot of cats.")
    else:
        print("That is not many cats.")
except:
    print("You did not enter a number.")

\end{verbatim}

\begin{verbatim}
How many cats do you have?
t
You did not enter a number.
\end{verbatim}
\end{document}
